---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.DuplicateValue
source: html/af8889b0-6b56-7d99-b397-22441415d95b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.DuplicateValue Property

Elements have duplicate '[Value]' values.

## Syntax (C#)
```csharp
public static FailureDefinitionId DuplicateValue { get; }
```